#include "screen.h"

COORD Screen::pos = { INIT_X, INIT_Y };

void Screen::set(int x, int y) {
	pos.X = x;
	pos.Y = y;
}

int Screen::get_y() {
	return pos.Y;
}
int Screen::get_x() {
	return pos.X;
}


void Screen::gotoxy() {
	SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), pos); //Ä¿¼­ ¼³Á¤
}
void Screen::line_print(string str) {
	gotoxy();
	cout << str << endl;
	getchar();
	pos.Y++;
}

void Screen::print(string str) {
	gotoxy();
	cout << str << endl;
	pos.Y++;
}


void Screen::clear() {
	pos.X = INIT_X-1;
	pos.Y = INIT_Y;
	for (int i = 0; i < 9; i++) {
		print("                                                                                           ");
	}
	set(INIT_X, INIT_Y);
	gotoxy();
}

//¼öÈ¯
// ÇÁ·¹ÀÓ Ãâ·Â
void Screen::print_frame() {
	system("cls");
	cout << "¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡                         ¡¡¡¡ ¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡                         ¡¡¡¡ ¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡                         ¡¡¡¡ ¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡                         ¡¡¡¡ ¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡                         ¡¡¡¡ ¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡                         ¡¡¡¡ ¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡                         ¡¡¡¡ ¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á" << endl;
	cout << "¡á  ¡¡¡¡¡¡¡¡¡¡¡¡¡¡                                                                              ¡á" << endl;
	cout << "¡á     ¡¡¡¡                                                                                     ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á" << endl;
}
// ÅØ½ºÆ® Ã¢ Áö¿ì±â
void Screen::text_clear() {
	pos.X = TEXT_INIT_X;
	pos.Y = TEXT_INIT_Y;
	for (int i = 0; i < 20; i++) {
		print("                                                                                           ");
	}
	set(TEXT_INIT_X, TEXT_INIT_Y);
	gotoxy();
}

int Screen::KeyIn() {
	while (true) {
		int key = _getch(); // Å° ÀÔ·Â¹Þ±â
		if (key == 'M' || key == 'm') {
			return MAP;
		}
		else if (key == 224) {
			key = _getch();
			switch (key) {
			case UP:
				return UP;
				break;
			case DOWN:
				return DOWN;
				break;
			}
		}
		else if (key == 13) {
			return ENTER;
		}
	}
}

// ¸Ê Ãâ·Â
void Screen::print_map() {
	system("cls");
	cout << "¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á" << endl;
	cout << "¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡ ¿Á»ó ¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡¡¡ã¡ã¡ã¡¡¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á  ¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡  ¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡  ¡¡¡á¡¡¡¡¡¡¡¡  ¡á¡¡  ¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡¡ 1-1¡¡¡¡¡á¡¡ 1-2¡¡¡¡¡á¡¡ 1-3¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡È­Àå½Ç¡¡¡á¡¡¼¼Å¹½Ç¡¡¡á°Ý¸®»ýÈ°°ü¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡  ¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡  ¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á  ¡á¡á¡á¡á¡á¡ã¡á¡á¡á¡á¡á¡ã¡á¡á¡á¡á¡á¡ã¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡ã¡á¡á¡á¡á¡á¡ã¡á¡á¡á¡á¡á¡ã¡á¡á¡á¡á¡á  ¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡2Ãþ ¼­Æí¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡ 2Ãþ Áß¾Ó º¹µµ¡¡  ¡¡2Ãþ µ¿Æí¡¡¡¡¡¡Ä­¸·ÀÌ¡¡¡¡¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡á¡á¡á¡á¡å¡á¡á¡á¡á¡á¡å¡á¡á¡á¡á¡á¡å¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡å¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡å¡á¡á¡á¡á¡á  ¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡  ¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡  ¡¡¡¡¡¡¡¡¡¡  ¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡¡ 2-1¡¡¡¡¡á¡¡ 2-2¡¡¡¡¡á¡¡ 2-3  ¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡  ¡á ¡¡2Áß´ë ÇàÁ¤¹Ý ¡¡¡á¡¡°£ºÎ¿¬±¸½Ç¡¡¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡  ¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á  ¡¡¡¡¡¡¡¡¡¡¡¡¡¡  ¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á  ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡¡¡¡¡¡¡¡¡¡¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á  ¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡  ¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡  ¡¡¡¡¡¡¡¡¡á¡¡  ¡¡¡¡  ¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡ÃÑ±âÇÔ½Ç¡¡¡¡¡¡¡á¡¡¡¡ÀÎ»ç°ú¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡±º¼ö°ú¡¡¡¡¡¡¡á¡¡Åë½Å¹°ÀÚÃ¢°í¡¡¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡  ¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡  ¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á  ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡ã¡á¡á¡á¡á¡á¡á¡á¡ã¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡ã¡á¡á¡á¡á¡á¡á¡á¡á¡ã¡á¡á¡á¡á¡á¡á¡á¡á  ¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡ 1Ãþ Áß¾Ó º¹µµ¡¡  ¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡å¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡å¡á¡á¡á¡á¡á¡á¡á¡á¡å¡á¡á¡á¡á¡á¡á¡á¡á  ¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡  ¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡  ¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á ¡¡¡¡¡¡¡¡¡¡ÁöÈÖ ÅëÁ¦½Ç¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡  ¡á¡¡ÁÖÀÓ ¿ø»ç½Ç ¡¡¡á¡¡¡¡´ë´ëÀå½Ç¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡  ¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á  ¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡á¡¡¡á" << endl;
	cout << "¡á  ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á  ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á" << endl;
	cout << "¡á  ¡¡¡¡¡¡¡¡¡¡¡¡¡¡                                                                              ¡á" << endl;
	cout << "¡á           ¡¡¡¡                                                                               ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á                                                                                              ¡á" << endl;
	cout << "¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á" << endl;
	Screen::line_print("");
}


